---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalElementSelector
source: html/b8d93e4d-3543-637d-5a9d-affa1bced099.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElementSelector

Specifies a portion of an Analytical Element or the whole element.

## Syntax (C#)
```csharp
public enum AnalyticalElementSelector
```